import React from "react";
import lines from '../images/lines.svg'
import ser0 from '../images/services0.svg';
import ser1 from '../images/services1.svg';
import ser2 from '../images/services2.svg';
import ser3 from '../images/services3.svg';
import ServiceElement from "./ServiceElement";
export default function Services(props) {
  const services = [
    {
      name: "Устройство монолитных конструкций",
      link: ser0,
      about:
        "Основным видом деятельности нашей компании являются работы по устройству монолитных бетонных и железобетонных конструкций. В настоящее время монолитное строительство зданий и сооружений стремительно развивается. Это объясняется его преимуществами, такими как скорость строительства, возможность создания практически любых планировочных решений и архитектурных форм. Другие материалы не позволяют добиться такого же эффекта. Работы производимые нашей компанией можно разделить на следующие виды: строительство монолитных зданий устройство монолитных фундаментов строительство монолитных конструкций (подпорные стенки, чаши бассейнов, перекрытия с несъемной опалубкой).",
    },
    {
      name: "Армирование и укладка бетонных полов",
      link: ser1,
      about:
        "Первым этапом при производстве монолитных работ являются геодезические работы. Он включает в себя размещение элементов и конструкций здания или сооружения в пространстве. От качества геодезических работ напрямую зависит устойчивость и долговечность все конструкции. Следующим этапом является армирование. Оно производится согласно проекту. Арматурные сетки и пространственные каркасы вяжутся вязальной проволокой. Сварка основной рабочей арматуры в большенстве случаев не допускается. Следующим этапом является монтаж опалубки. Опалубочные системы бывают различными(крупнощитовая сборка, мелкощитовая сборка, каркасно-ригельная сборка) но все эти системы служат для придания формы жидкому бетону. Сборка опалубки это трудоемкий и сложный процесс требующий определенных навыков и опыта. После армирования и устройства опалубки идет этап бетонирования конструкций. Это наименее трудоемкий процесс по сравнению с армированием и монтажем опалубки, но не менее ответственный. Бетонирование производят различными способами – напрямую с миксера, при помощи автобетононасоса, при помощи специальной бадьи и крана с обязательным уплотнением бетонной смеси вибраторами. Заключительным этапом является демонтаж опалубки и уход за бетоном. Уход за бетоном следует выполнять в условиях обеспечивающих нарастание его прочности.",
    },
    {
      name: "Внутренняя отделка помещений",
      link: ser2,
      about:
        "Технические помещения тоже нуждаются в проведении внутренних работ. Пол, стены и потолок в них должны быть прочными. Исходя из таких требований и материалов, из которых изготовлены несущие конструкции, внутренняя отделка гаража выполняется следующим образом: 1)На полу заливается бетонная стяжка, возможна укладка плитки керамической или тротуарной, неплохой вариант – шлифованная мраморная крошка. 2)Стена штукатурятся либо с добавлением колера, либо окрашиваются.  3)Если конструкция  каркасная, то возможна отделка плитами QSB или вагонкой. 4)Потолки покрываются шпатлевкой под покраску. Свои особенности имеет оформление помещений загородного дома, которое во многом определяется материалом стен и полов. Модные и практичные строения из оцилиндрованного бруса, например, не нуждаются в дополнительных декоративных покрытиях, кроме нанесения специальных составов, защищающих древесину. Внутренняя отделка дачи, построенной из кирпича или пенобетона, делается традиционными способами.",
    },
    {
      name: "Нанесение полимерных покрытий",
      link: ser3,
      about:"Основанием для нанесения полимерных покрытий являются бетонные стяжки. Устройство бетонных стяжек выполняется по этапам 1-4 технологии устройства бетонных полов с упрочненным верхним слоем без внесения топпинга. Затем идет этап подготовки основания. Он включает в себя удаление непрочно-держащихся частиц и цементного молочка с поверхности бетонного пола. Создания шероховатой поверхности, что позволяет увеличить адгезию верхнего полимерного покрытия к бетонному основанию. Следующим этапом является грунтование. Грунтовка пола упрочняет верхний слой бетона, обеспыливает основание и запечатывает все поры, а в смеси с сухим кварцевым песком позволяет заполнить все сколы и раковины бетонного основания.",
    },
  ];
  return (
    <div className="servicesMain">
      <div className="services">
        <div className="section__name_service">
          <div className="section__name__wrapper">
            <p className="section__name__text">Наши услуги</p>
          </div>
          <p className="section__name__text__slogan">
            Доверьтесь <br />
            мастерам <br />
            своего дела
          </p>
        </div>
        {services.map((item) => {
          return (
            <ServiceElement card={item} onCardClick={props.onServiceClick} />
          );
        })}
      </div>
      <img src={lines} className="servicesMain__img" />
    </div>
  );
}
